Revit 2026 API

# ExporterIFC Properties

---

The ExporterIFC type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportBaseQuantities | Identifies if the export should include IFC standard quantities currently supported by Revit. |
|  | FileName | The name of the IFC file being exported. |
|  | FileVersion | Identifies the file version being exported. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpaceBoundaryLevel | Identifies the level of space boundaries being exported. |
|  | WallAndColumnSplitting | Identifies if division of multi-level walls and columns by levels should take place during this export. |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace